# coding:utf-8
def pc_bet_form(type):
	bet_info = {
		#双色球单式
		'01':{'betnum':'040609172124-08$','betstr':'040609172124-08$01~1','lotteryid':200},
		#双色球复式
		'02':{'betnum':'01021112202530-10$','betstr':'01021112202530-10$02~7','lotteryid':200},
		#双色球胆拖
		'03':{'betnum':'(1316222833)0519-09$','betstr':'[1316222833]0519-09$03~2','lotteryid': 200},
		#3D直选单式
		'04':{'betnum':'1-6-9$','betstr':'1-6-9$1_1_1~1','lotteryid':201},
		#3D直选复式
		'05': {'betnum': '26-5-7$', 'betstr': '26-5-7$1_1_2~2', 'lotteryid': 201},
		#3D直选和值
		'06': {'betnum': None, 'betstr': '0$1_2~1', 'lotteryid': 201},
		#3D组三投注
		'07': {'betnum': None, 'betstr': '13$2_2~2', 'lotteryid': 201},
		#3D组六单式
		'08': {'betnum': None, 'betstr': '2-3-6$3_1~1', 'lotteryid': 201},
		#组六复式
		'09': {'betnum': None, 'betstr': '0268$3_2~4', 'lotteryid': 201},
		#七乐彩单式
		'10': {'betnum': '03070915212330$', 'betstr': '03070915212330$01~1', 'lotteryid': 202},
		#七乐彩复式
		'11': {'betnum': '0710131719222529$', 'betstr': '0710131719222529$02~8', 'lotteryid': 202},
		# 七乐彩胆拖
		'12': {'betnum': '(020423242630)0708$', 'betstr': '[020423242630]0708$03~2', 'lotteryid': 202},
		# 大乐透单式
		'13': {'betnum': '2425263235-0510$', 'betstr': '2425263235-0510$01~1', 'lotteryid': 51},
		# 大乐透复式
		'14': {'betnum': '0102081618-091012$', 'betstr': '0102081618-091012$02~3', 'lotteryid': 51},
		# 大乐透胆拖
		'15': {'betnum': '(09162431)2226-0312$', 'betstr': '[09162431]2226-0312$02~2', 'lotteryid': 51},
		# 七星彩单式
		'16': {'betnum': '0-7-4-5-8-4-8$', 'betstr': '0-7-4-5-8-4-8$01~1', 'lotteryid': 52},
		# 七星彩复式
		'17': {'betnum': '35-0-6-3-0-5-4$', 'betstr': '35-0-6-3-0-5-4$01~2', 'lotteryid': 52},
		# 排列五单式
		'18': {'betnum': '7-2-4-2-2$', 'betstr': '7-2-4-2-2$01~1', 'lotteryid': 53},
		# 排列五复式
		'19': {'betnum': '2-07-4-4-6$', 'betstr': '2-07-4-4-6$01~2', 'lotteryid': 53},
		# 排列三单式
		'20': {'betnum': '8-8-5$', 'betstr': '8-8-5$1_1~1', 'lotteryid': 54},
		# 排列三复式
		'21': {'betnum': '05-9-5$', 'betstr': '05-9-5$1_2~2', 'lotteryid': 54},
		# 排列三直选和值
		'22': {'betnum': '1$', 'betstr': '1$1_3~3', 'lotteryid': 54},
		# 排列三单式组合
		'23': {'betnum': '024$', 'betstr': '024$1_4~6', 'lotteryid': 54},
		# 排列三组三单式
		'24': {'betnum': '6-1-6$', 'betstr': '6-1-6$2_1~1', 'lotteryid': 54},
		# 排列三组三复式
		'25': {'betnum': '14$', 'betstr': '14$2_2~2', 'lotteryid': 54},
		# 排列三组六单式
		'26': {'betnum': '246$', 'betstr': '246$3_1~1', 'lotteryid': 54},
		# 排列三组六复式
		'27': {'betnum': '0135$', 'betstr': '0135$3_2~4', 'lotteryid': 54},
		# 排列三组选和值
		'28': {'betnum': '2$', 'betstr': '2$4_1~2', 'lotteryid': 54},
	}
	return bet_info.get(type)

