
#coding:utf-8
from pymemcache.client.base import Client
client = Client(('127.0.0.1',11211))
print   eval(client.get('bet_25'))

# [{"ball":"107109:周日018:[None_250.0]/107108:周日017:[None_60.00]","data":"107109:周日018:[None_250.0]/107108:周日017:[None_60.00]^2串1","tag":"jczq","times":"1","note":1,"money":2,"matchcount":2}]
# [{"ball":"107004:周六008:[让球主负_1.64]/107005:周六009:[让球主负_1.80]","data":"107004:周六008:[让球主负_1.64]/107005:周六009:[让球主负_1.80]^2串1","tag":"jczq","times":"1","note":1,"money":2,"matchcount":2}]

[{"ball":"107009:周六013:[主负_1.98]/107010:周六014:[主负_1.74]","data":"107009:周六013:[主负_1.98]/107010:周六014:[主负_1.74]^2串1","tag":"jczq","times":"1","note":1,"money":2,"matchcount":2}]
[{"ball":"107009:周六013:[主负_1.98]/107010:周六014:[主负_1.74]","data":"107009:周六013:[主负_1.98]/107010:周六014:[主负_1.74]^2串1","tag":"jczq","times":"1","note":1,"money":2,"matchcount":2}]